Tekla Open API Reference for Tekla Structures 2025
PolylineAttributes Constructor
Overload List
Name | Description
Polyline.PolylineAttributes()
 Creates a new default polyline attributes instance that loads standard attributes.
Polyline.PolylineAttributes(String)
 Creates a new polyline attributes instance that loads the specified attributes.
Top
See Also
Reference
Polyline.PolylineAttributes Class
Tekla.Structures.Drawing Namespace